*** 5.4 Resolution Method (7 min)
    [[https://spark-public.s3.amazonaws.com/intrologic/exercises/exercise_04_04_01.html][Ex 1.]]
    [[https://spark-public.s3.amazonaws.com/intrologic/exercises/exercise_04_04_02.html][Ex 2.]]
    Clausal Form
    Premises: {p, p => q, (p => q) => (q => r)}
    Conlclusion: r
    
    | Premises:      | Clauses:  |
    |----------------+-----------|
    | p              | {p}       |
    | p => q         | {~p,q}    |
    | (p=>q)=>(q=>r) | {~p,~q,r} |
    |                | {~q,r}    |
    | ~r             | {~r}      |
    |----------------+-----------|

    Resolution proof:

    |---+-----------+---------|
    | 1 | {p}       | Premise |
    | 2 | {~p,q}    | Premise |
    | 3 | {~p,~q,r} | Premise |
    | 4 | {~q,r}    | Premise |
    | 5 | {~r}      | Premise |
    | 6 | {q}       | 1,2     |
    | 7 | {r}       | 4,6     |
    | 8 | {}        | 5,7     |
    |---+-----------+---------|
    #+TBLFM: $1=vlen(@I$1..0);EN

